# ComputeRoomVolumeNotCheckedWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EnergyAnalysisFailures..::..ComputeRoomVolumeNotCheckedWarn Property
BuiltInFailures..::..EnergyAnalysisFailures Class See Also
---
The setting for calculation of Volume Computations is not on. The analysis model produced will be approximate without the computation of Areas and Volumes
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ComputeRoomVolumeNotCheckedWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ComputeRoomVolumeNotCheckedWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ComputeRoomVolumeNotCheckedWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace